<template>
  <b-card-text>
    <b-card no-body>
      <b-tabs card align="center">
        <b-tab title="主要規則" class="pb-1" active>

          <section>
            <p>遊戲從起始玩家開始，並向左順時針進行，探險者輪流進行回合並探索屋子。</p>
            <p>為了簡單起見，所有規則中的「你」皆指正在進行動作或受到卡牌、房屋板塊規則影響的角色——探險者（包含英雄與叛徒）以及怪物。</p>
          </section>

          <section>
            <h4>屬性／檢定</h4>
            <p>每位探險者皆有四個<b>〈屬性 Trait〉</b>，由角色卡四邊的四排數字所表示：<b>〈力量 Might〉</b>、<b>〈速度 Speed〉</b>、<b>〈知識 Knowledge〉</b>、<b>〈神志 Sanity〉</b>。力量與速度為<b>〈物理 Physical〉</b>屬性，而知識與神志為<b>〈精神 Mental〉</b>屬性。</p>
            <p>許多卡片、房間板塊、以及遊戲效果會影響你的屬性。當任何效果提升或降低你的任一屬性時，將該屬性的指標滑動相對應的格數。舉例來說，Zoe Ingstrom 的初始力量為３，若有個效果提升她３點力量時，將她的力量指標往數字大的那側滑動，指到４的位置。</p>
            <p>每個屬性皆有其最大值，也就是角色卡上該屬性那排數字的最大值。當屬性受到效果影響而提升時，無法超過其最大值。</p>
            <p>另外，每個屬性的最小值下方皆有一個<b>〈骷髏頭 Skull〉</b>標誌。在作祟發生後，當你的任一屬性將至骷髏頭標誌時，你的探險者就會死亡。在作祟發生前，沒有人會死亡——也就是說，任何屬性皆不會將至骷髏頭標誌。當屬性受到效果影響而降低到或超過骷髏頭標誌時，改為停在該屬性的最小值。舉例來說，Zoe Ingstrom 的初始神志為５，若有個效果降低她２點神志時，將她的神志指標往骷髏頭的那側滑動，指到３的位置。若她再失去２點神志，除非作祟尚未發生，否則她將會死亡。</p>
            <p><b>〈傷害 Damage〉</b>：許多卡片、房間板塊、以及遊戲效果會對你造成傷害。當你受到<b>〈物理傷害 Physical Damage〉</b>時，你可將該傷害自由分配到力量和速度，並對兩個屬性下降總和為該傷害的格數。同樣地，當你受到<b>〈精神傷害 Mental Damage〉</b>時，如同物理傷害的操作，但改為下降知識和神志。</p>
            <p><i>附註：</i>Zoe Ingstrom 的力量由大到小分別為「７、６、４、４、<b class="text-success">『３』</b>、３、２、２、骷髏」，神志為「８、７、６、６、５、<b class="text-success">『５』</b>、４、３、骷髏」，其中『』為起始值。</p>
          </section>

          <section>
            <h4>回合進行</h4>
            <p>在你的回合當中，你可以以任意順序進行以下動作（任意次數）：</p>
            <ul class="mb-2">
              <li><b>移動</b>，</li>
              <li><b>探索</b>新房間，</li>
              <li><b>使用</b>物品（道具卡與預兆卡），</li>
              <li><b>執行擲骰</b>，</li>
              <li><b>發動攻擊</b>（一回合一次，僅能在作祟發生後執行）。</li>
            </ul>
            <p>在作祟發生前，若你抽到預兆卡，你必須回合結束時進行<b>〈作祟檢定 Haunt Roll〉</b>（詳見<b-link to="/rules/haunt">作祟</b-link>章節）。作祟發生後，遊戲將會有些許的改變（詳見<b-link to="/rules/haunt">作祟</b-link>章節）。</p>
          </section>

        </b-tab>

        <b-tab title="移動" class="pb-1" active>

          <section>
            <h4>移動</h4>
            <p>在你的回合中，你可以移動至多等於探險者的<b>速度</b>的距離。在移動中，你進行任何行動（如使用物品或發動攻擊）。然而，</p>
          </section>

        </b-tab>

      </b-tabs>
    </b-card>
  </b-card-text>
</template>

<script>
export default {};
</script>
